// C언어코딩 :: printf 제어문자

#include <stdio.h>

int main(void)
{
	puts("--------------------------");
	puts(" *제어 문자 *");
	puts("---------------------------");

	puts("\\n은 new line-줄바꿈");
	puts("----------------------");

	puts("\\t는 tab간격(보통8칸)");
	puts("------------------------");

	puts("\\b는 back-좌측으로 커서 한 칸 이동");
	puts("----------------------------");

	puts("\\a는 alert-경고음(삐) 발생");
	puts("---------------------------");

	puts("\\0는 NULL문자- 문자열의 끝을 나타냄");
	puts("--------------------------------");

	return 0;
}