// c언어코딩 :: printf 보기좋게 출력

#include <stdio.h>

int main(void)
{
	puts("------------------");
	puts(" ** 보기 좋게 출력 ** ");
	puts("-------------------");

	printf(" [%d] 그 자리 출력 \n", 777);
	puts("-------------------------");

	printf("  [\t%d] 탭키 만큼 띄고 출력\n", 777);
	puts("-------------------------");

	printf(" [%-10d] 10칸 잡고 좌측 정렬\n", 777);
	puts("-------------------------");

	printf("[%10d] 10칸 잡고 우측 정렬\n", 777);
	puts("-------------------------");
	
	printf(" [%-20s] 20칸 잡고 좌측 정렬\n", "HAPPY");
	puts("------------------------------");

	printf(" [%20s] 20칸잡고 우측정렬\n", "love");
	puts("------------------------------------");
	puts("소스 코드 옆에 출력화면을 놓고 비교해 보세요.");
	puts("------------------------------------");

	return 0;
}